1 a) We have two algorithms for sorting pictures of birds and people, with the flowing truth tables

In [1]:
import numpy as np
import pandas as pd

In [13]:
tBird = [45,3]
tPerson = [5,47]
NN = ['NN Bird', 'NN Person']
x = {'#1':NN,'True Bird' : tBird, 'True Person': tPerson,}
tTable1 = pd.DataFrame(x)


tBird = [47,1]
tPerson = [11,42]
NA = ['NA Bird', 'NA Person']
x = {'#2':NA,'True Bird' : tBird, 'True Person': tPerson,}
tTable2 = pd.DataFrame(x)

tTable1.set_index('#1')

           True Bird  True Person
#1
NN Bird           45            5
NN Person          3           47

In [14]:
tTable2.set_index('#2')

           True Bird  True Person
#2
NA Bird           47           11
NA Person          1           42

Algorithm 1 (NN) which is shown on table #1 has the fewest error with 8 while algorithm 2 (NA) which is shown in table #2 has 12

1 b)

Algorithm 2 is better for the zoo because it has the least number of birds being falsely reported as people, what we really want to see is the ratios between false reported birds to false reported persons. Algorithm 1 has a ratio of $3/5$ and algorithm 2 has a ratio of $1/11$. this will allow us to see if the cost of losing 3 birds is worth stopping 5 people for 30 second verses losing 1 bird and stopping 11 people 30 second and double the number of people we stop should be worth cutting the number of escaped bird by three.

1 c)

New truth table for both algorithms but now we cut the number of people going out of the exhibit so that only 1% of the pictures taken are of people.

In [25]:
tBird = [4875,325]
tPerson = [5,47]
NN = ['NN Bird', 'NN Person']
x = {'#1':NN,'True Bird' : tBird, 'True Person': tPerson,}
tTable1 = pd.DataFrame(x)

tBird = [5092,108]
tPerson = [11,42]
NA = ['NA Bird', 'NA Person']
x = {'#2':NA,'True Bird' : tBird, 'True Person': tPerson,}
tTable2 = pd.DataFrame(x)

tTable1.set_index('#1')

           True Bird  True Person
#1
NN Bird         4875            5
NN Person        325           47

In [26]:
tTable2.set_index('#2')

           True Bird  True Person
#2
NA Bird         5092           11
NA Person        108           42

2 a)
we would get an Erlang distribution with k=2 and $\mu$ is the same as in the original exponential distribution

2 b)
We would get a Standard Cauchy distribution

2 c)
The 2D Gaussian distribution if we only measure probability of the magnitude of the vector input would be a Rayleigh distribution